fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_Отпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Отпуска</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CommonModules/ВКМ_РаботаСОтпускамиВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РассчитатьКоличествоДнейОтпуска(ДокГрафикОтпусков, Сотрудник) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковОтпуска.Сотрудник,
	|	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпуска.ДатаНачала, ВКМ_ГрафикОтпусковОтпуска.ДатаОкончания, ДЕНЬ)) КАК
	|		КолДнейОтпуска
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.Отпуска КАК ВКМ_ГрафикОтпусковОтпуска
	|ГДЕ
	|	ВКМ_ГрафикОтпусковОтпуска.Ссылка = &Ссылка
	|	И ВКМ_ГрафикОтпусковОтпуска.Сотрудник = &Сотрудник
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ГрафикОтпусковОтпуска.Сотрудник";

	Запрос.УстановитьПараметр("Ссылка", ДокГрафикОтпусков);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		КолДней = ВыборкаДетальныеЗаписи.КолДнейОтпуска;
	Иначе
		КолДней = 0;
	КонецЕсли;
	Возврат КолДней;

КонецФункции	

#КонецОбласти
